#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты.ДобавитьТест("ОбработкаВалидации");

КонецПроцедуры

#Область События

Процедура ПередВсемиТестами() Экспорт

КонецПроцедуры

Процедура ПередКаждымТестом() Экспорт

КонецПроцедуры

Процедура ПослеКаждогоТеста() Экспорт

КонецПроцедуры

Процедура ПослеВсехТестов() Экспорт

КонецПроцедуры

#КонецОбласти

Процедура ОбработкаВалидации() Экспорт
	
	МодельДанных = Новый Структура;
	ИмяСхемы = "";
	Спецификация = "";
	
	ЮТест.ОжидаетЧто(инт_ВалидаторПакетов)
	.Метод("Валидировать")
	.Параметр(МодельДанных)
	.Параметр(ИмяСхемы)
	.Параметр(Спецификация)
	.ВыбрасываетИсключение("Схема не найдена");
	
КонецПроцедуры

#КонецОбласти
